title: Percussion Spider APT Group
description: Percussion Spider APT Group IoC's
author: EchoCTI Team (Buğra KÖSE, Bilal BAKARTEPE)
date: 2023/07/10
status: experimental
logsource:
  product: windows
detection:
  selectionHash:
    event_id: 1
    event_data.Hashes:
    - b4d4fd6181d0eecf544d57860ebaf58f
    - 097ea5787a940f6c6e4639514064807d0824d95ab9bfbf7125301092071c043b
    - 071d51c772ac833ef0ad78ba2881bb0ccc4e0db3
  selectionURL:
    resource.URL:
     - https://185.108.129.62/
     - http://185.108.129.62/
  condition: selectionHash or selectionURL
falsepositives:
- Check there is any attack by Percussion Spider  
level: high