title: STATIC KITTEN APT Group 
description: Detects if STATIC KITTEN have been infected to the system
author: Bilal Bakartepe, Buğra Köse
references:
- https://www.anomali.com/blog/probable-iranian-cyber-actors-static-kitten-conducting-cyberespionage-campaign-targeting-uae-and-kuwait-government-agencies
- https://attack.mitre.org/groups/G0069/
date: 2023/07/19
status: experimental
logsource:
  product: windows
detection:
  selectionHash:
    event_id: 1
    event_data.Hashes:
    - b19b3d3f49c63d196289594752ff5e34e507b2ba8427f8f3ca3e70ab177119f2
    - 7c05f1cb77c2b5e86b9ead517b59c53dbff086728a6fef50b9bbf77902cfffd1
    - 43e7239878ff2886246ba6eb9f0fff467754d3492ff7cbda9e5a70866f4800b3
    - 18fdec81f212359abcd231e1f2614501d7f4ec8f8fbff6a68da4d6a5701bc6f6
    - a7be0438e1686024f4bafc8031b04ad8573263901a3a4dda9ebd0a4fa4012313
    - 7d31f378155e25473bcdce8bc978803241c966b64e7301102c4b2af4656686a9
    - ed3ac22dbd2b2927be704e14901d2758c6c222e75470eac0fe33ed5958148413
    - 567ce1bfa3ea49eaa279ec848c777f01523d22f9aff86864fe2d4205b551960f
    - af15f26a2c5d88a8b3da35c0d99da1dd7424c3edf194182c1554ec6e69b6d865
    - 034ad1e52a1cdead649751d94e3d0109ca73609e78a529e0eb7920d8979ee44a
    - 93c351ba312d1cfca5bfed6fd74278e3625989b630dc83f71b5541965fbecc19
    - 705983b1ae0cd9f6b1caac7de75d8a51da7272dada5a01406a59214b358e1de3
    - 9466ec0108f84c162bc53125059904473cd3e823fae6e536f414493d8747e9ca
    - a62909c78aecc49f09fd059bd622aa5cc15dbca5ce43e337f69d777008eb5f58
    - ce8dda13060382a7e4959fe1deb3aa4163deef5114c285a987b84921e42c2007
    - 17e6c0b8cd9a4a1998a5ec09a4869bb8ef1f629bbea91f28b41d79b313e5b530
    - 2db94e93aa7add75d3b38650223c060fe355583b410684bb2388816f2f1c3f07
    - 7341180c0a50157fec0ed2278bee2f8eaebab7f27d3063b7ebfa1b34db41a81a
    - 7bc02f30d28ae1887d5ef5d3ea38828919de174657676cf45b34ecc009f11f28
    - 19069077fac9bee1afeb43a491444e971d0bca4e02a08b53f5c1fd3398a4e8cf
    - 59a4c6de5403abc47cbb1b45b3bb164b73ad1c70429febf6af55fe4ad4207422
    - 9107be160f7b639d68fe3670de58ed254d81de6aec9a41ad58d91aa814a247ff
    - 618ddcb8b62ce1043739d5bb8fd8b03b1e890c715ddf34e4d66ee919fef22c21
    - 912666420a202f5a61c3601fb37643832c865744ae096937685f14acbd0ac24a
    - 2a5f74e8268ad2d38c18f57a19d723b72b2dadd11b3ab993507dd2863d18008d
    - 8711d3e6cf0b9d34fdde878f33f84ec0b9304971
    - df909b80074ab1555884afff1f8f8e6896450cd7
    - 16aa949f9fd3139d9e8623b0432226cd21c02b20
    - eac18badb07d535cd3a4e4f12f05c839081e8da8
    - 919aa9add61245a6838b713fa66da28fdf3830db
    - 976db03c235be2d07da9f84356fe32c7af90401e
    - b66f6f52a0c0d2d3d3fe7816954149bb5953ccce
    - a98068b1f352be397b536e792b5ac9b05b7502fe
    - f95963b1045f9cffb5c93eeb3667f960d9a74015
    - 1b22d4b005f0c5e6a72de246ef7e74f732b32607
    - 4366244c40508161d9b2c263440db27fcc328f80
    - 5805c1efb8b8ea94457e3a3a8aacf9eba28e4baa
    - 4b1cc0b60cc298c3a6a8de6f0d6996df9a3b338f
    - 8d11d37e9c99e8098949d0a484d5d089a3f6c352
    - a181e5b4ec77b157bd07e646c6287613d798306f
    - ef13c830e7b9d964212f05e1a0ec541de9e15973
    - 8a208184417175a80c3b69b1ed0a6d4a6e21c767
    - 5187bef65db2d2c659ae8ec362ebab160322d45d
    - fa9999e9a644a82aa8ecd5c8028d095bcf07f15b
    - 5bbce7baed4c0dc2d0bd5e76a64af1c5118a9771
    - 8c6b286329d6510b9983aec0d26155742dbc04df
    - 2fac183a2d583a452d6dd8ee0a8f3d8198b4f4a2
    - 30466ccd4ec7bcafb370510855da2cd631f74b7a
    - dc988a0a0554e4af2e253fbf6d3ceb378a481edb
    - ec4a1c0f1f4f25e9e417fe1ac8c3a4d685425a02
    - e2d16fdf836d5697cba2223ae288e756df319406
    - a4beaac2c11e06c02f378413c525ada3
    - 2910d502591154b12c4622a25dd9fe93
    - 4871b06818515c7aa36ae6705e0c71dd
    - 96b6e5682f980866f5f5809dc7a339d7
    - aea6f547160fcbef8e595f4003e26e53
    - 6f5779ec628ace0372ca2df4af5054cb
    - a854cd0ddbf54add8a0035efd9052a29
    - 2d4e1e97ba6716a5523ca19698d184a4
    - 58b9dea5be1bef017978f176d5ad7384
    - a84c72683c0e6d75b9326f6da01cfe1b
    - aaf5aaf417cc00fa951dd5206b6317bb
    - 8de62ca34209cf9fc84c92e1713309f0
    - f28d243d69775562ef248100e4e5ce4d
    - a670a29e8bbb014b413f4ed012a39456
    - db802777c26b52a00ceca8fcbd193fe0
    - f587dd3ba26c6ea145907ce6d21aecfa
    - 6df57c3363e012ffd1863f597b96e2c8
    - 9d99008e3936dd2075ecaacbd7465f73
    - 70e52f0457ff75b59c635c7b88363ac5
    - 15d34673cab32736e77fa6ae17b5d0d3
    - cfb11b2dc39379c622abeaea8fac6944
    - 2776f96e911f4015bab32c51ea9ce2db
    - bb407a2d3b5c9c9ef2c7dd52a04307da
    - 9880fae6551d1e9ee921f39751a6f3c0
    - 5b8680ecc0812a434634aa62a4ab9a6a
    - 3ee2c60ea7db8bc03aad03cce99de2e8
  selectionURL:
    resource.URL:
      - https://henkormerise.com/
      - http://185.183.98.17
      - http://45.159.248.244
      - http://91.235.234.130
      - http://141.95.177.129
      - http://185.254.37.173
      - http://194.61.121.86
      - http://149.202.216.53
      - www.vatacloud.com
      - http://home.firepower-cisco.com/bytefile
      - http://home.firepower-cisco.com/answer
      - http://mdspacc.com/MDSresumetemplates/Employment%20application.docm
      - http://home.firepower-cisco.com/answer1
      - http://home.firepower-cisco.com/home1
      - firepower-cisco.com
      - mdspacc.com
      - home.firepower-cisco.com
      - http://home.firepower-cisco.com
      - bankbuana.com
      - ws.onehub.com/files/7w1372el
      - ws.onehub.com/files/94otjyvd
      - instance-sy9at2-relay.screenconnect.com
      - instance-uwct38-relay.screenconnect.com
  condition: selectionHash or selectionURL
falsepositives:
- Unknown
level: high
tags:
- attack.T1036
- attack.T1566
- attack.T1219
- attack.T1566.001
- attack.T1566.002
- attack.T1204
- attack.T1204.002