title: Ransomware Payload Detection (LockBit)
description: Ransomware Payload Detection (LockBit)
author: Emir Erdogan
reference:
- https://capesandbox.com/analysis/3747/
status: stable
tags:
- attack.T1486
- attack.T1547.001
logsource:
product: windows
service: sysmon
detection:
selection:
Image|endswith:
- '*\cmd.exe'
ParentImage|endswith:
- '*\p2IkHYSud.exe'
CommandLine|contains:
- 'vssadmin delete shadows /all /quiet & wmic shadowcopy delete & bcdedit /set {default} bootstatuspolicy ignoreallfailures & bcdedit /set {default} recoveryenabled no'
condition: selection
falsepositives:
- unknown
level: high
id: cf26c2d2-6e9f-481e-8121-15b1203e7a67